[{
		"num": "5",
		"title": "Wikipedia Searcher",
		"address": "wikipedia-viewer",
		"date": "June 2016",
		"description": "The challenge was to build a site that uses the <a href='http://www..mediawiki.org/wiki/API:Main_page' target='_blank'>MediaWiki API</a> to fetch search results and display them. For this page, I've used jQuery and JSON/Ajax to request and receive JSONP from Wikipedia, then parse those results and build result boxes using jQuery. The page also features some basic CSS animation upon loading and to display additional search results. Another <a href='http://www.freecodecamp.com' target='_blank'>Free Code Camp</a> assignment.",
		"img": "wikipedia_project.png",
		"tags": ["HTML5/CSS3", "jQuery", "Ajax/JSON", "MediaWiki API"],
		"highlight": true
	},

	{
		"num": "4",
		"title": "Weather App",
		"address": "local-weather",
		"date": "June 2016",
		"description": "This page is designed to grab geolocation data and display weather data for a users location.  As a <a href='http://www.freecodecamp.com' target='_blank'>Free Code Camp</a> assignment, requirements were to display current weather in a user's location and toggle metric/imperial units with a button. These tasks are accomplished with an API call to <a href='http://www.freegeoip.net' target='_blank'>freegeoip.net</a> and <a href='http://www.openweathermap.org/api' target='_blank'>OpenWeatherMap</a>, jQuery to parse the data and write it to HTML, and functions to convert unit.  Aside from those requirements, I included a refresh button and a progress bar that tells the user the status of the refresh, and then hides when complete.  Additional goals for this project were to use Bootstrap 3 to a deeper degree, focus on using semantic HTML, and create a mobile design. For that reason, the page is best viewed with a small or extra-small viewport.",
		"img": "weather_app.png",
		"tags": ["HTML5/CSS3", "Bootstrap 3", "jQuery", "Ajax/JSON", "JavaScript"],
		"highlight": false
	},

	{
		"num": "3",
		"title": "Quote Machine",
		"address": "random-quote-machine",
		"date": "June 2016",
		"description": "This page, also created to fulfill a <a href='http://www.freecodecamp.com' target='_blank'>Free Code Camp</a> assignment, uses JavaScript to select a random number, reads an quote bank stored in an object, and then uses jQuery to write the quote to the page. Users may also tweet the quote by clicking a twitter icon. My goals for this page were to apply CSS layouts to create a custom layout, not relying on CSS frameworks.  I've also tried to exercise my design muscles with a minimalist layout and expressive color.",
		"img": "quote_machine.png",
		"tags": ["HTML5/CSS", "jQuery", "JavaScript"],
		"highlight": true
	},



	{
		"num": "2",
		"title": "Portfolio Website, first draft",
		"address": "portfolio_draft.html",
		"codepen": "pbvKNR",
		"date": "June 2016",
		"description": "This was my first attempt at a portfolio website, using a model from <a href='http://www.freecodecamp.com' target='_blank'>Free Code Camp</a>.  This project's aim was to create a navbar and use links to social media.",
		"img": "portfolio_first.png",
		"tags": ["HTML5/CSS3", "Bootstrap 3"],
		"highlight": false
	},



	{
		"num": "1",
		"title": "Tribute Page",
		"address": "tribute.html",
		"codepen": "WxbGoB",
		"date": "June 2016",
		"description": "This was my first page while working through the <a href='http://www.freecodecamp.com' target='_blank'>Free Code Camp</a> curriculum. The assignment was to built a tribute page, relying heavily on formatting with Bootstrap, that included a picture and external links.",
		"img": "tribute_thumb.png",
		"tags": ["HTML5/CSS3", "Bootstrap 3"],
		"highlight": false
	}]
